Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.RoomNotUpperBoundedByElement Property
 [Family] is not upper bounded by a roof, ceiling or floor element. This can result in incorrect adjacencies and voids in the analytical model. Please ensure that Upper Limit and Limit Offset for [Room] is set correctly.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomNotUpperBoundedByElement { get; }
Public Shared ReadOnly Property RoomNotUpperBoundedByElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomNotUpperBoundedByElement {
	FailureDefinitionId^ get ();
}
static member RoomNotUpperBoundedByElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace